using System.Reflection.Metadata.Ecma335;
using static System.Runtime.InteropServices.JavaScript.JSType;

namespace MyStatic;

/// <summary>
/// Клас, який уміє парсити дані
/// </summary>
class MyParser
{
    /// <summary>
    /// Метод шукає всі цифри в рядку та формує з них ціле число (int).
    /// </summary>
    /// <param name="str">Рядок, із якого потрібно витягнути цифри.</param>
    /// <returns>
    /// Сформоване число або -1, якщо цифр у рядку не знайдено.
    /// </returns>
    public static int ParseToInt(string str)
    {
        //Початкове значення результату
        //-1 означає, що цифр поки не знайдено
        int result = -1;

        //Отримуємо довжину вхідного рядка для циклу
        int len = str.Length;

        //Проходимо по кожному символу рядка
        for (int i = 0; i < len; i++)
        {
            //Отримуємо поточний символ за індексом
            char c = str[i];

            //Перевіряємо за кодом ASCII, чи є символ цифрою
            if (c >= '0' && c <= '9')
            {
                //Перетворюємо символ цифри у її числове значення
                //Наприклад, '5' - '0' = 5
                int digit = c - '0';

                //Якщо це перша знайдена цифра, ініціалізуємо result
                if (result == -1)
                {
                    result = digit;
                }
                else
                {
                    //Якщо цифра не перша, зсуваємо розряд попереднього числа (множимо на 10) 
                    //Та додаємо нову цифру
                    //Наприклад, було 1, стало 1*10 + 8 = 18
                    result *= 10;
                    result += digit;
                }
            }
        }
        // Повертаємо підсумкове число або -1, якщо цифр не було
        return result;
    }
}

//Статичний конструктор — це спеціальний метод класу, призначений для одноразової ініціалізації статичних полів
//або виконання підготовчих дій для всього класу.
